app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test1"], ["text", "test1test1"], ["created_at", "2015-11-22 14:23:51.812656"], ["updated_at", "2015-11-22 14:23:51.812656"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save